Revit 2027 API
Dimension.Origin Property
 The dimension origin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when:
SpotDimension has more than one segments.
Remarks
 The origin is the middle point of the dimension line that makes up the dimension. This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding property of the DimensionSegment class.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace